"кот" > "код"; //true  д<т
"2" + 2 * "2"; // 24 (сначала 2*2 с численным преобразованием, затем конкатенация
undefined == null; // true  равны друг другу и больше ничему
undefined != null; // false они равны друг и ничему больше
null == 0; // false null равен только undefined и ничему больше
2 > "3"; // false численное преобразование 2 < 3
null - false + true; // 1 численное преобразование. получаем 0 - 1 + 0
1 / "l"; //NaN численное преобразование. "I" = NaN
"2" * "3"; // 6
4 + 5 + "O"; // 9O
"l" + 4 + 5; // l45
"4" - 2; // 2
"4" - "4x"; // Nan
"23" == 23; // true
null == false; // false null равняется undefined и ничему больше
" -4 " / 0 + 1; // -Infinity
null + 1; // 1
undefined + null; // Nan
1 === "1";
"2" > 10;
NaN == undefined;
